Revit 2027 API
ParameterTypeId.PathReinSpanlengthBarlengthAlt Property
 "Length (Alternating Bar)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PathReinSpanlengthBarlengthAlt { get; }
Public Shared ReadOnly Property PathReinSpanlengthBarlengthAlt As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PathReinSpanlengthBarlengthAlt {
	ForgeTypeId^ get ();
}
static member PathReinSpanlengthBarlengthAlt : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace